# Core
brew "bash"
brew "zsh"
brew "stow"
brew "vim"
brew "tmux"
brew "reattach-to-user-namespace"

# Filesystem
brew "tree"

# Git
brew "git"
brew "git-lfs"
brew "tig"
brew "git-filter-repo"

# Development General
brew "cloc"

# Shell
brew "shellcheck"

# Apple
cask "apparency"
brew "swiftlint"
cask "provisionql"
cask "xcodes"

# JSON
brew "jq"
cask "quicklook-json"

# Ruby
brew "ruby"

# Python
brew "python"

# Fonts
tap "homebrew/cask-fonts"
cask "font-meslo-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-charis-sil"
