# Core
brew "bash"
brew "coreutils"
brew "zsh"
brew "stow"
brew "vim"
brew "tmux"
brew "reattach-to-user-namespace"

# Filesystem
brew "tree"

# Git
brew "git"
brew "git-lfs"
brew "tig"
brew "git-filter-repo"
brew "gnupg"
cask "github"

# Development General
brew "cloc"

# Shell
brew "shellcheck"

# Apple
cask "apparency"
brew "swiftlint"
cask "provisionql"
cask "xcodes"
brew "mint"
cask "db-browser-for-sqlite"

# Android
cask "android-studio"

# API Development
#cask "charles"
brew "mkcert"
brew "nss"

# JSON
brew "jq"
cask "quicklook-json"

# Node
brew "node"

# C#
cask "powershell"

# Ruby
brew "ruby"

# Python
brew "python"

# YAML
brew "yq"

# Database
cask "dbeaver-community"

# Crowdin
tap "crowdin/crowdin"
brew "crowdin"

# Fonts
#tap "homebrew/cask-fonts"
cask "font-meslo-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-3"
cask "font-source-serif-4"
cask "font-charis-sil"
